In [1]:
import numpy as np
import pandas as pd

In [ ]:
# Pandas <= numpy

# python으로 하는 excel...
# datatype
# 1. Series <- numpy 1차원 vector
# 2. DataFrame <- series 여러개가 column으로 이어서 만들어진 matrix <- numpy matrix

### Series
* numpy array vector - index가 없다
* series <= numpy array vector + index
* pd.Series()

In [4]:
L = [1,2,3,4]
s = pd.Series(L)
s

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
L = [1,2,3,4]
s = pd.Series(L, index = ['a', 'b','c','d'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
s['c']

3

In [8]:
s['c'] = 10
s

a     1
b     2
c    10
d     4
dtype: int64

In [9]:
s[['c','d']]

c    10
d     4
dtype: int64

In [11]:
s > 5  # broadcasting > element wise operating

a    False
b    False
c     True
d    False
dtype: bool

In [12]:
s[s > 5]  # boolean indexing

c    10
dtype: int64

In [13]:
s * 2

a     2
b     4
c    20
d     8
dtype: int64

In [14]:
'a' in s

True

In [15]:
s

a     1
b     2
c    10
d     4
dtype: int64

In [16]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [17]:
s.values

array([ 1,  2, 10,  4], dtype=int64)

In [19]:
s.index = ['가','나','다','라']
s

가     1
나     2
다    10
라     4
dtype: int64

### DataFrame
* series 가 column 단위로 붙어서 만들어진 matrix (series => dataframe)
* pd.DataFrame()

In [20]:
raw_data = {'first_name': ['jason', np.nan, 'tina', 'jake', 'amy'],
           'last_name': ['miller', np.nan, 'ali', 'milner', 'coozer'],
           'age':[42, np.nan, 36, 24, 73],
           'pretestscore':[4, np.nan, np.nan, 2, 4],
           'postestscore':[25, np.nan, np.nan, 62, 72]}
raw_data

{'first_name': ['jason', nan, 'tina', 'jake', 'amy'],
 'last_name': ['miller', nan, 'ali', 'milner', 'coozer'],
 'age': [42, nan, 36, 24, 73],
 'pretestscore': [4, nan, nan, 2, 4],
 'postestscore': [25, nan, nan, 62, 72]}

In [23]:
# dict key => columns
# dict value => columns 값

df = pd.DataFrame(raw_data)
df

  first_name last_name   age  pretestscore  postestscore
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    milner  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [ ]:
# 데이터를 가공할 때 일반적 보편적 처리 방식..,

# column - 특징을 칼럼으로 잡는다. 예 - 학생 학년, 이름, 주소, 성정 ...
# row - 개별 데이터. 예 - 첫번째 학생, 두번째 학생..

# column - feature, 열, 
# row - data, 행

In [ ]:
# 하나의 칼럼 - 하나의 series < np.array < 원소가 동일한 데이터타입으로 구성..
# dataframe - series가 연결된 matrix

# 하나의 칼럼은 동일한 타입의 데이터로 구성된다
# 칼럼 간에는 다른 데이터타입의 칼럼들이 존재한다..

In [25]:
# column indexing => df[col_name]

In [29]:
df.head(2)

  first_name last_name   age  pretestscore  postestscore
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN

In [27]:
df['first_name']

0    jason
1      NaN
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [31]:
df[['last_name', 'age']]

  last_name   age
0    miller  42.0
1       NaN   NaN
2       ali  36.0
3    milner  24.0
4    coozer  73.0

In [34]:
df.first_name  

# 속성으로 칼럼을 접근하는 방식..
# 1. 칼럼이름에 space가 있으면 안 됨.
# 2. 칼럼을 수정할 때 주의가 필요..

0    jason
1      NaN
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [35]:
# df['age'] = df['age'].apply(lambda x : x*10)

0    420.0
1      NaN
2    360.0
3    240.0
4    730.0
Name: age, dtype: float64

In [37]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [38]:
df.columns

Index(['first_name', 'last_name', 'age', 'pretestscore', 'postestscore'], dtype='object')

In [39]:
df.values  # array

array([['jason', 'miller', 42.0, 4.0, 25.0],
       [nan, nan, nan, nan, nan],
       ['tina', 'ali', 36.0, nan, nan],
       ['jake', 'milner', 24.0, 2.0, 62.0],
       ['amy', 'coozer', 73.0, 4.0, 72.0]], dtype=object)

In [ ]:
# row indexing

# df.loc[index name]
# df.iloc[index order num]

# loc[], iloc[] - row와 column을 동시에 선택할 수도 있다..

In [41]:
df.index = ['a','b','c','d','e']
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [42]:
df.loc['d']

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [43]:
df.iloc[3]

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [44]:
df.iloc[3:]

  first_name last_name   age  pretestscore  postestscore
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [45]:
df.loc['d':]

  first_name last_name   age  pretestscore  postestscore
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [46]:
df.loc[['c','e']]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [47]:
df.iloc[[2,4]]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [49]:
df.loc['b':'d']

  first_name last_name   age  pretestscore  postestscore
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0

In [ ]:
# df.loc[row name, col name],   df.iloc[row index, col index] 
# - row와 column을 동시에 선택할 수도 있다..

In [50]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [51]:
df.loc['c', 'last_name']

'ali'

In [52]:
df.iloc[2, 1]

'ali'

In [54]:
df.loc[['c','d'], 'first_name' : 'age']

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [56]:
df.iloc[[2,3], :3]

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [57]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [58]:
df.loc['d', 'pretestscore'] = 100.0
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [59]:
df.loc[['c','e'], ['age', 'postestscore']]

    age  postestscore
c  36.0           NaN
e  73.0          72.0

In [61]:
df.iloc[[2,4], [2,4]]

    age  postestscore
c  36.0           NaN
e  73.0          72.0

In [65]:
df.loc['d':, 'pretestscore':]

   pretestscore  postestscore
d         100.0          62.0
e           4.0          72.0

In [67]:
df.iloc[3:, 3:]

   pretestscore  postestscore
d         100.0          62.0
e           4.0          72.0

In [68]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [72]:
df.iloc[1:5:2, :]

  first_name last_name   age  pretestscore  postestscore
b        NaN       NaN   NaN           NaN           NaN
d       jake    milner  24.0         100.0          62.0

In [73]:
# dataframe에 boolean indexing도 가능하다..  => row indexing : loc[]

In [74]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [76]:
df.loc[df['age'] >= 40]

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
e        amy    coozer  73.0           4.0          72.0

In [77]:
# 'last_name'이 'ali'인 사람의 데이터를 출력하시오..

In [80]:
df.loc[df['last_name'] == 'ali']

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN

In [81]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [82]:
# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?

In [88]:
df.loc[df['age'] > 40]['postestscore'].mean()

48.5

In [89]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [90]:
# 새로운 칼럼 추가...

In [91]:
df['address'] = ['seoul', 'incheon', 'daejeon', 'pusan', 'gwangju']
df

  first_name last_name   age  pretestscore  postestscore  address
a      jason    miller  42.0           4.0          25.0    seoul
b        NaN       NaN   NaN           NaN           NaN  incheon
c       tina       ali  36.0           NaN           NaN  daejeon
d       jake    milner  24.0         100.0          62.0    pusan
e        amy    coozer  73.0           4.0          72.0  gwangju

In [92]:
# 칼럼명 수정

In [93]:
df

  first_name last_name   age  pretestscore  postestscore  address
a      jason    miller  42.0           4.0          25.0    seoul
b        NaN       NaN   NaN           NaN           NaN  incheon
c       tina       ali  36.0           NaN           NaN  daejeon
d       jake    milner  24.0         100.0          62.0    pusan
e        amy    coozer  73.0           4.0          72.0  gwangju

In [94]:
df.columns = ['fn', 'ln', 'age', 'pres', 'posts','add']
df

      fn      ln   age   pres  posts      add
a  jason  miller  42.0    4.0   25.0    seoul
b    NaN     NaN   NaN    NaN    NaN  incheon
c   tina     ali  36.0    NaN    NaN  daejeon
d   jake  milner  24.0  100.0   62.0    pusan
e    amy  coozer  73.0    4.0   72.0  gwangju

In [102]:
# df = df.rename(columns = {'add':'address'})
df.rename(columns = {'add':'address'}, inplace=True)
df

      fn      ln   age   pres  posts  address
a  jason  miller  42.0    4.0   25.0    seoul
b    NaN     NaN   NaN    NaN    NaN  incheon
c   tina     ali  36.0    NaN    NaN  daejeon
d   jake  milner  24.0  100.0   62.0    pusan
e    amy  coozer  73.0    4.0   72.0  gwangju

In [103]:
df

      fn      ln   age   pres  posts  address
a  jason  miller  42.0    4.0   25.0    seoul
b    NaN     NaN   NaN    NaN    NaN  incheon
c   tina     ali  36.0    NaN    NaN  daejeon
d   jake  milner  24.0  100.0   62.0    pusan
e    amy  coozer  73.0    4.0   72.0  gwangju

In [104]:
# column 또는 row를 삭제...

In [109]:
df.drop('address', axis=1, inplace=True)
df

      fn      ln   age   pres  posts
a  jason  miller  42.0    4.0   25.0
b    NaN     NaN   NaN    NaN    NaN
c   tina     ali  36.0    NaN    NaN
d   jake  milner  24.0  100.0   62.0
e    amy  coozer  73.0    4.0   72.0

In [110]:
df.drop('c', axis=0)

      fn      ln   age   pres  posts
a  jason  miller  42.0    4.0   25.0
b    NaN     NaN   NaN    NaN    NaN
d   jake  milner  24.0  100.0   62.0
e    amy  coozer  73.0    4.0   72.0

In [113]:
df

      fn      ln   age   pres  posts
a  jason  miller  42.0    4.0   25.0
b    NaN     NaN   NaN    NaN    NaN
c   tina     ali  36.0    NaN    NaN
d   jake  milner  24.0  100.0   62.0
e    amy  coozer  73.0    4.0   72.0

In [114]:
df.drop(['ln', 'pres'], axis=1)

      fn   age  posts
a  jason  42.0   25.0
b    NaN   NaN    NaN
c   tina  36.0    NaN
d   jake  24.0   62.0
e    amy  73.0   72.0